# Plotly Express

https://plot.ly/python/plotly-express/

In [1]:
import plotly.express as px

In [2]:
print(px.data.iris.__doc__)
px.data.iris().head()

Each row represents a flower.

https://en.wikipedia.org/wiki/Iris_flower_data_set

Returns:
    A `pandas.DataFrame` with 150 rows and the following columns:
    `['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species', 'species_id']`.

   sepal_length  sepal_width  petal_length  petal_width species  species_id
0           5.1          3.5           1.4          0.2  setosa           1
1           4.9          3.0           1.4          0.2  setosa           1
2           4.7          3.2           1.3          0.2  setosa           1
3           4.6          3.1           1.5          0.2  setosa           1
4           5.0          3.6           1.4          0.2  setosa           1

In [3]:
print(px.data.tips.__doc__)
px.data.tips()

Each row represents a restaurant bill.

https://vincentarelbundock.github.io/Rdatasets/doc/reshape2/tips.html

Returns:
    A `pandas.DataFrame` with 244 rows and the following columns:
    `['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size']`.

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
print(px.data.carshare.__doc__)
px.data.carshare()

Each row represents the availability of car-sharing services near the centroid of a zone
in Montreal.

Returns:
    A `pandas.DataFrame` with 249 rows and the following columns:
    `['centroid_lat', 'centroid_lon', 'car_hours', 'peak_hour']`.

     centroid_lat  centroid_lon    car_hours  peak_hour
0       45.471549    -73.588684  1772.750000          2
1       45.543865    -73.562456   986.333333         23
2       45.487640    -73.642767   354.750000         20
3       45.522870    -73.595677   560.166667         23
4       45.453971    -73.738946  2836.666667         19
..            ...           ...          ...        ...
244     45.547171    -73.556258   951.416667          3
245     45.546482    -73.574939   795.416667          2
246     45.495523    -73.627725   425.750000          8
247     45.521199    -73.581789  1044.833333         17
248     45.532564    -73.567535   694.916667          5

[249 rows x 4 columns]